spec/dummy/app/controllers/employees_controller.rb

  def batch_actions
    @employees = Employee.find(Array.wrap(params[:ids]))
    @collection = Employee::Collection.new(@employees)
    redirect_to employees_path, alert: 'No employees selected' if @collection.empty?
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22)
SELECT COUNT(*) FROM "employees"

  def process_batch
    @employees = Employee.find(Array.wrap(params[:ids]))
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN (1, 2)