spec/dummy/app/views/employees/index.html.slim

SELECT "employees".* FROM "employees"
---
br
button onclick="window.location = Routes.batch_actions_employees_path({ids: multi_select.selected_ids()})" Actions